read_verilog -lib scripts/cells.v

# Split up nets into individual bits
splitnets -ports; opt

# Map to our cells
abc -liberty scripts/cells.lib -script scripts/gates.abc

clean
